# PathType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalFileReference..::..PathType Property
ExternalFileReference Class See Also
---
The path type of the link (relative, absolute, or server).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public PathType PathType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PathType As PathType
	Get
```

Visual C++
---
```text
public:
property PathType PathType {
	PathType get ();
}
```

# See Also
ExternalFileReference Class
Autodesk.Revit.DB Namespace